In [3]:
import pandas as pd

In [4]:
import warnings 
warnings.filterwarnings('ignore')

In [7]:
data = {
    "Employee_ID": ["E1", "E2", "E3", "E4"],
    "Name": ["Asha", "Ravi", "Neha", "Arjun"],
    "Department": ["IT", "HR", "IT", "Finance"],
    "Gender": ["F", "M", "F", "M"],
    "Salary": [60000, 50000, 75000, 65000],
    "Score": [78, 85, 92, 88]
}

df = pd.DataFrame(data)
df

  Employee_ID   Name Department Gender  Salary  Score
0          E1   Asha         IT      F   60000     78
1          E2   Ravi         HR      M   50000     85
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88

In [8]:
#üîπ PART 1: UNDERSTANDING DATA & SHAPE
#1Ô∏è‚É£ Identify the Structure
#Input
 #The DataFrame df
#Expected Output
#Number of rows ‚Üí 4  
#Number of columns ‚Üí 6
rows = df.shape[0]
cols = df.shape[1]

print("Number of rows ‚Üí", rows)
print("Number of columns ‚Üí", cols)

Number of rows ‚Üí 4
Number of columns ‚Üí 6

In [11]:
#Input
# The DataFrame df
#Expected Output
#(4, 6)
df.shape

(4, 6)

In [12]:
#3Ô∏è‚É£ Column Count Verification
#Input
 #The DataFrame df
#Expected Output
#6
cols=df.shape[1]
cols

6

## üîπ PART 2: ROW & COLUMN SELECTION

In [13]:
#4Ô∏è‚É£ Select a Row Using Employee_ID
##Employee_ID = "E2"
#Expected Output
#Employee_ID
#Name
#Department
#Gender
#Salary
#Score
#E2
#Ravi
#HR
#M
#50000
#85
df[df["Employee_ID"] == "E2"]

  Employee_ID  Name Department Gender  Salary  Score
1          E2  Ravi         HR      M   50000     85

In [15]:
#5Ô∏è‚É£ Select a Row Using Position
#Input
# Row position = 1
#Expected Output
df.iloc[[1]]

  Employee_ID  Name Department Gender  Salary  Score
1          E2  Ravi         HR      M   50000     85

In [16]:
#6Ô∏è‚É£ Select Specific Columns
#Input
# Columns = Name and Salary
df[["Name", "Salary"]]

    Name  Salary
0   Asha   60000
1   Ravi   50000
2   Neha   75000
3  Arjun   65000

## üîπ PART 3: FILTERING USING CONDITIONS

In [17]:
#7Ô∏è‚É£ Salary-Based Filtering
#Input
# Salary greater than 60000
df[df["Salary"] > 60000]

  Employee_ID   Name Department Gender  Salary  Score
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88

In [18]:
#8Ô∏è‚É£ Multiple Conditions Filtering
#Input
# Department = IT
# Salary greater than 65000
df[(df["Department"] == "IT") & (df["Salary"] > 65000)]

  Employee_ID  Name Department Gender  Salary  Score
2          E3  Neha         IT      F   75000     92

In [24]:
#9Ô∏è‚É£ Conditional Value Update
#Input
 #Score column
df["Updated Score"] = df["Score"].clip(lower=80)
df[["Updated Score"]]

   Updated Score
0             80
1             85
2             92
3             88

## üîπ PART 4: INDEX OPERATIONS

In [3]:
import pandas as pd

In [4]:
data = {
    "Employee_ID": ["E1", "E2", "E3", "E4"],
    "Name": ["Asha", "Ravi", "Neha", "Arjun"],
    "Department": ["IT", "HR", "IT", "Finance"],
    "Gender": ["F", "M", "F", "M"],
    "Salary": [60000, 50000, 75000, 65000],
    "Score": [78, 85, 92, 88]
}

df = pd.DataFrame(data)
df

  Employee_ID   Name Department Gender  Salary  Score
0          E1   Asha         IT      F   60000     78
1          E2   Ravi         HR      M   50000     85
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88

In [6]:
#üîü Change the Index
#Input

 #Column name = Employee_ID
# Check uniqueness first
#print(df["Employee_ID"].is_unique)

# Then set index
print(df["Employee_ID"].is_unique)

True

In [8]:
#1Ô∏è‚É£1Ô∏è‚É£ Restore Default Index
#Input
 #DataFrame with Employee_ID as index
#Expected Output
# Default numeric index (0,1,2,3)
#Task
 #Reset the index.

df = df.reset_index(drop=True)
df

  Employee_ID   Name Department Gender  Salary  Score
0          E1   Asha         IT      F   60000     78
1          E2   Ravi         HR      M   50000     85
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88

In [9]:
#1Ô∏è‚É£2Ô∏è‚É£ Index Sorting
#Input
 #Index order = E3, E1, E4, E2
#Expected Output
#E1, E2, E3, E4
#Task
 #Sort the DataFrame by index in ascending order.
df = df.sort_index()
df

  Employee_ID   Name Department Gender  Salary  Score
0          E1   Asha         IT      F   60000     78
1          E2   Ravi         HR      M   50000     85
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88

## üîπ PART 5: SORTING ROWS

In [10]:
#1Ô∏è‚É£3Ô∏è‚É£ Sort by Salary
#Input
 #Salary column
#Expected Output
 #Salaries arranged from highest to lowest
#Task
 #Sort employees by salary in descending order.
df = df.sort_values(by="Salary", ascending=False)
df

  Employee_ID   Name Department Gender  Salary  Score
2          E3   Neha         IT      F   75000     92
3          E4  Arjun    Finance      M   65000     88
0          E1   Asha         IT      F   60000     78
1          E2   Ravi         HR      M   50000     85

In [11]:
#1Ô∏è‚É£4Ô∏è‚É£ Sort by Department and Salary
#Input
 #Department (A‚ÄìZ), Salary (High ‚Üí Low)
#Expected Output
 #Employees grouped by department and ordered by salary within each department
#Task
 #Perform multi-column sorting.
df = df.sort_values(by=["Department", "Salary"],
                    ascending=[True, False])
df

  Employee_ID   Name Department Gender  Salary  Score
3          E4  Arjun    Finance      M   65000     88
1          E2   Ravi         HR      M   50000     85
2          E3   Neha         IT      F   75000     92
0          E1   Asha         IT      F   60000     78

## üîπ PART 6: GROUPING DATA

In [12]:
#1Ô∏è‚É£5Ô∏è‚É£ Department-wise Salary Total
#Input
 #Department and Salary columns
#Expected Output
#Department
#Total Salary
dept_salary_total = df.groupby("Department")["Salary"].sum()
print(dept_salary_total)

Department
Finance     65000
HR          50000
IT         135000
Name: Salary, dtype: int64

In [13]:
#1Ô∏è‚É£6Ô∏è‚É£ Department and Gender Grouping
#Input
 #Department, Gender, Salary
#Expected Output
 #Grouped salary summary
#Task
 ##Group employees by department and gender
grouped = df.groupby(["Department", "Gender"])["Salary"].sum()
print(grouped)

Department  Gender
Finance     M          65000
HR          M          50000
IT          F         135000
Name: Salary, dtype: int64

In [14]:
#1Ô∏è‚É£7Ô∏è‚É£ Multiple Aggregations
#Input
 #Department and Salary
#Expected Output
#Department
#Minimum Salary
#Maximum Salary
#Task
# Find minimum and maximum salary per department.
result = df.groupby("Department")["Salary"].agg(["min", "max"])
print(result)

              min    max
Department
Finance     65000  65000
HR          50000  50000
IT          60000  75000

## üîπ PART 7: SUMMARY TABLES

In [15]:
#1Ô∏è‚É£8Ô∏è‚É£ Pivot Table
#Input
 #Department and Salary
#Expected Output
 #Average salary per department
##Create a pivot table.
pivot = pd.pivot_table(
    df,
    values="Salary",
    index="Department",
    aggfunc="mean"
)

print(pivot)

             Salary
Department
Finance     65000.0
HR          50000.0
IT          67500.0

In [16]:
#1Ô∏è‚É£9Ô∏è‚É£ Cross Tabulation
#Input
 #Gender and Department
#Expected Output
 #Count of employees for each gender in each department
#Task
 #Create a cross-tabulation table.
crosstab = pd.crosstab(df["Gender"], df["Department"])
print(crosstab)

Department  Finance  HR  IT
Gender
F                 0   0   2
M                 1   1   0

## üîπ PART 8: FINAL COMBINED TASK

In [17]:
#2Ô∏è‚É£0Ô∏è‚É£ Complete Data Processing
#Input
 #The DataFrame df
#Expected Output
 #Sorted, department-wise salary summary table
#Task
 #Apply filtering, grouping, aggregation, sorting, and index reset.
result = (
    df
    .dropna(subset=["Salary"])
    .assign(Salary=lambda x: pd.to_numeric(x["Salary"]))
    .groupby("Department", as_index=False)
    .agg(
        Total_Salary=("Salary", "sum"),
        Average_Salary=("Salary", "mean"),
        Employee_Count=("Salary", "count")
    )
    .sort_values(by="Total_Salary", ascending=False)
    .reset_index(drop=True)
)

print(result)

  Department  Total_Salary  Average_Salary  Employee_Count
0         IT        135000         67500.0               2
1    Finance         65000         65000.0               1
2         HR         50000         50000.0               1